case20/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   10;
        log             true;
        patches         (airfoil);
        rho             rhoInf;      // Indicates incompressible.
        rhoInf          1.18;        // Redundant for incompressible (value does not matter).
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        CofR            (0 0 0);  // bottom-wing leading edge.
        pitchAxis       (0 0 1);  // positive pitch-down, negative pitch-up.
        magUInf         7;           // Matches 0/U.
        lRef            1.0;         // Normalized chord.
        Aref            0.1;         // Cell depth * chord.
    }
}





// ************************************************************************* //
