case20/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     0.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


5
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          59768;
        startFace       44611;
    }

    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          7;
        startFace       104379;
    }

    walls
    {
        type            wall;
        physicalType    wall;
        nFaces          28;
        startFace       104386;
    }

    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          7;
        startFace       104414;
    }

    airfoil
    {
        type            wall;
        physicalType    wall;
        nFaces          388;
        startFace       104421;
    }

)


// ************************************************************************* //
